In [12]:
import pandas as pd

In [13]:
people_data = {
    "first": ["Sam", "Jack", "Samir", "Arun"],
    "last": ["Das", "Smith", "Khan", "Banerjee"],
    "email": ["sam.das@gmail.com", "jack.smith@gmail.com", "samir.khan@gmail.com", "arun.banerjee@gmail.com"]
}

In [14]:
df = pd.DataFrame(people_data)

In [15]:
df

   first      last                    email
0    Sam       Das        sam.das@gmail.com
1   Jack     Smith     jack.smith@gmail.com
2  Samir      Khan     samir.khan@gmail.com
3   Arun  Banerjee  arun.banerjee@gmail.com

In [16]:
df['email']

0          sam.das@gmail.com
1       jack.smith@gmail.com
2       samir.khan@gmail.com
3    arun.banerjee@gmail.com
Name: email, dtype: object

In [17]:
type(df['email'])

pandas.core.series.Series

In [18]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [19]:
df.iloc[[0, 1], [0,2]]

  first                 email
0   Sam     sam.das@gmail.com
1  Jack  jack.smith@gmail.com

In [20]:
df.loc[[0, 1], ['first', 'email']]

  first                 email
0   Sam     sam.das@gmail.com
1  Jack  jack.smith@gmail.com

In [24]:
df['email'] = df['email'].str.lower()

In [25]:
df

   first      last                    email
0    Sam       Das        sam.das@gmail.com
1   Jack     Smith     jack.smith@gmail.com
2  Samir      Khan     samir.khan@gmail.com
3   Arun  Banerjee  arun.banerjee@gmail.com

In [42]:
df.columns = [x.lower() for x in df.columns]
df

  first_name      last                    email  last
0        Sam       Das        sam.das@gmail.com   NaN
1       Jack     Smith     jack.smith@gmail.com   NaN
2      Samir      Khan     samir.khan@gmail.com   NaN
3       Arun  Banerjee  arun.banerjee@gmail.com  Khan

In [33]:
df.rename(columns = {'FIRST' : 'FIRST_NAME'}, inplace=True)
df

  FIRST_NAME      LAST                    EMAIL
0        Sam       Das        sam.das@gmail.com
1       Jack     Smith     jack.smith@gmail.com
2      Samir      Khan     samir.khan@gmail.com
3       Arun  Banerjee  arun.banerjee@gmail.com

In [43]:
df.loc[3, 'last']

last    Banerjee
last        Khan
Name: 3, dtype: object

In [44]:
df

  first_name      last                    email  last
0        Sam       Das        sam.das@gmail.com   NaN
1       Jack     Smith     jack.smith@gmail.com   NaN
2      Samir      Khan     samir.khan@gmail.com   NaN
3       Arun  Banerjee  arun.banerjee@gmail.com  Khan